/*
 * =====================================================================================
 *
 *       Filename:  menu.c
 *
 *    Description:  
 *
 *        Version:  1.0
 *        Created:  2020年05月26日 22时10分41秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  longshao (ls), ls56647426@foxmail.com
 *   Organization:  
 *
 * =====================================================================================
 */

#include "menu.h"

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showInitMenu
 *  Description:  
 * =====================================================================================
 */
void showInitMenu()
{
	printf("主界面\n");
	printf("【1】登录\n");
	printf("【2】注册\n");
	printf("【0】退出\n");
	printf("清选择您的操作：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showLoginMenu
 *  Description:  
 * =====================================================================================
 */
void showLoginMenu()
{
	printf("登录界面\n");
	printf("请输入您的用户名；\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showRegisterMenu
 *  Description:  
 * =====================================================================================
 */
void showRegisterMenu()
{
	printf("注册界面\n");
	printf("请输入您的用户名；\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showHomeMenu
 *  Description:  
 * =====================================================================================
 */
void showHomeMenu()
{
	printf("个人主页\n");
	printf("【1】获取好友在线列表\n");
	printf("【2】创建群\n");
	printf("【3】加好友\n");
	printf("【4】加群\n");
	printf("【5】私聊\n");
	printf("【6】进群\n");
	printf("【0】退出\n");
	printf("清选择您的操作：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showCreateGroupMenu
 *  Description:  
 * =====================================================================================
 */
void showCreateGroupMenu()
{
	printf("请输入群名称：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showAddUserMenu
 *  Description:  
 * =====================================================================================
 */
void showAddUserMenu()
{
	printf("请输入对方名称：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showAddGroupMenu
 *  Description:  
 * =====================================================================================
 */
void showAddGroupMenu()
{
	printf("请输入群名称：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showSelectChatUserMenu
 *  Description:  
 * =====================================================================================
 */
void showSelectChatUserMenu()
{
	printf("请选择聊天对象：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showSelectChatGroupMenu
 *  Description:  
 * =====================================================================================
 */
void showSelectChatGroupMenu()
{
	printf("请选择您要进入的群：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showChatGroupMenu
 *  Description:  
 * =====================================================================================
 */
void showChatGroupMenu()
{
	printf("群菜单\n");
	printf("【1】获取群成员在线列表\n");
	printf("【2】上传群文件\n");
	printf("【3】查看群文件\n");
	printf("【4】下载群文件\n");
	printf("【5】发言\n");
	printf("【0】退出\n");
	printf("请选择您的操作：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showSelectFileUpdate
 *  Description:  
 * =====================================================================================
 */
void showSelectFileUpdate()
{
	printf("请输入本地文件的路径：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showChatUserMenu
 *  Description:  
 * =====================================================================================
 */
void showChatUserMenu()
{
	printf("私聊菜单\n");
	printf("【1】发言\n");
	printf("【2】控制对方电脑\n");
	printf("【3】请求远程协助\n");
	printf("【0】退出\n");
	printf("请选择您的操作：\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showFileUploadMenu
 *  Description:  
 * =====================================================================================
 */
void showFileUploadMenu()
{
	printf("选择上传文件模块\n");
	printf("ls [pathname] - 查看当前路径下文件\n");
	printf("cd [pathname] - 切换当前路径\n");
	printf("is [filename] - 选择该文件进行上传\n");
}

/* 
 * ===  FUNCTION  ======================================================================
 *         Name:  showFileDownloadMenu
 *  Description:  
 * =====================================================================================
 */
void showFileDownloadMenu()
{
	printf("选择下载文件模块\n");
	printf("ls [pathname] - 查看当前路径下文件\n");
	printf("cd [pathname] - 切换当前路径\n");
	printf("is [filename] - 下载为该文件\n");
}





